---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineRiseType
source: html/4e75bd97-69d1-a7a9-a18d-216d768c4635.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineRiseType Property

Symbol for a 2 line rise

## Syntax (C#)
```csharp
public RiseDropSymbol TwoLineRiseType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration